; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v9 ?v10)
             (pred_12 ?v11 ?v8)
             (pred_4 ?v9 ?v8)
             (pred_9 ?v1 ?v9 )
	     (pred_7 ?v9)
             (pred_8 ?v6)
             (pred_10 ?v11)
             (pred_11 ?v8)
             (pred_5 ?v9)
             (pred_2 ?v11)
             (pred_6 ?v9)
             (pred_1 ))



(:action op_3
:parameters (?v7 ?v3 ?v5 ?v2)
:precondition (and (pred_8 ?v7) (pred_8 ?v3) (pred_10 ?v5) (pred_11 ?v2)
          (pred_3 ?v7 ?v3) (pred_12 ?v5 ?v2)
                   (pred_4 ?v3 ?v2) (pred_7 ?v7) 
                   (pred_5 ?v3) (pred_2 ?v5))
:effect (and  (pred_6 ?v3) (not (pred_5 ?v3))))


(:action op_1
:parameters (?v7 ?v12)
:precondition (and (pred_8 ?v7) (pred_8 ?v12)
               (pred_7 ?v7) (pred_3 ?v7 ?v12) (pred_6 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v7))))

(:action op_5
:parameters (?v7 ?v5)
:precondition (and (pred_8 ?v7) (pred_10 ?v5) 
                  (pred_7 ?v7) (pred_9 ?v5 ?v7) (pred_1 ))
:effect (and (pred_2 ?v5)
   (not (pred_9 ?v5 ?v7)) (not (pred_1 ))))


(:action op_2
:parameters (?v7 ?v4 ?v13)
:precondition (and (pred_8 ?v7) (pred_10 ?v4) (pred_10 ?v13)
                  (pred_7 ?v7) (pred_2 ?v13) (pred_9 ?v4 ?v7))
:effect (and (pred_2 ?v4) (pred_9 ?v13 ?v7)
        (not (pred_2 ?v13)) (not (pred_9 ?v4 ?v7))))

(:action op_4
:parameters (?v7 ?v5)
:precondition (and (pred_8 ?v7) (pred_10 ?v5) 
                  (pred_7 ?v7) (pred_2 ?v5))
:effect (and (pred_1 ) (pred_9 ?v5 ?v7) (not (pred_2 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_30 obj_18 obj_15 obj_25 obj_23 obj_28 obj_26 obj_19 obj_11 obj_08 obj_31 obj_16 obj_10 obj_22 obj_27 obj_20 obj_02 obj_13 obj_24 obj_14 obj_17 obj_01 obj_06 obj_12
    obj_21 obj_03 obj_05
    obj_29 obj_07 obj_09
    )

    (:init
       (pred_1)

       (pred_8 obj_04)
       (pred_8 obj_30)
       (pred_8 obj_18)
       (pred_8 obj_15)
       (pred_8 obj_25)
       (pred_8 obj_23)
       (pred_8 obj_28)
       (pred_8 obj_26)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_08)
       (pred_8 obj_31)
       (pred_8 obj_16)
       (pred_8 obj_10)
       (pred_8 obj_22)
       (pred_8 obj_27)
       (pred_8 obj_20)
       (pred_8 obj_02)
       (pred_8 obj_13)
       (pred_8 obj_24)
       (pred_8 obj_14)
       (pred_8 obj_17)
       (pred_8 obj_01)
       (pred_8 obj_06)
       (pred_8 obj_12)
       (pred_11 obj_21)
       (pred_11 obj_03)
       (pred_11 obj_05)
       (pred_10 obj_29)
       (pred_10 obj_07)
       (pred_10 obj_09)

       (pred_3 obj_04 obj_23)
       (pred_3 obj_04 obj_30)
       (pred_3 obj_30 obj_28)
       (pred_3 obj_30 obj_18)
       (pred_3 obj_30 obj_04)
       (pred_3 obj_18 obj_26)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_18 obj_30)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_15 obj_25)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_25 obj_11)
       (pred_3 obj_25 obj_15)
       (pred_3 obj_23 obj_08)
       (pred_3 obj_23 obj_28)
       (pred_3 obj_23 obj_04)
       (pred_3 obj_28 obj_31)
       (pred_3 obj_28 obj_26)
       (pred_3 obj_28 obj_30)
       (pred_3 obj_28 obj_23)
       (pred_3 obj_26 obj_16)
       (pred_3 obj_26 obj_19)
       (pred_3 obj_26 obj_18)
       (pred_3 obj_26 obj_28)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_19 obj_26)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_11 obj_25)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_08 obj_27)
       (pred_3 obj_08 obj_31)
       (pred_3 obj_08 obj_23)
       (pred_3 obj_31 obj_20)
       (pred_3 obj_31 obj_16)
       (pred_3 obj_31 obj_28)
       (pred_3 obj_31 obj_08)
       (pred_3 obj_16 obj_02)
       (pred_3 obj_16 obj_10)
       (pred_3 obj_16 obj_26)
       (pred_3 obj_16 obj_31)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_10 obj_22)
       (pred_3 obj_10 obj_19)
       (pred_3 obj_10 obj_16)
       (pred_3 obj_22 obj_24)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_22 obj_10)
       (pred_3 obj_27 obj_14)
       (pred_3 obj_27 obj_20)
       (pred_3 obj_27 obj_08)
       (pred_3 obj_20 obj_17)
       (pred_3 obj_20 obj_02)
       (pred_3 obj_20 obj_31)
       (pred_3 obj_20 obj_27)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_02 obj_16)
       (pred_3 obj_02 obj_20)
       (pred_3 obj_13 obj_06)
       (pred_3 obj_13 obj_24)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_02)
       (pred_3 obj_24 obj_12)
       (pred_3 obj_24 obj_22)
       (pred_3 obj_24 obj_13)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_14 obj_27)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_20)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_01 obj_06)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_06 obj_13)
       (pred_3 obj_06 obj_01)
       (pred_3 obj_12 obj_24)
       (pred_3 obj_12 obj_06)
       (pred_5 obj_01)
       (pred_5 obj_17)
       (pred_5 obj_28)
       (pred_4  obj_01 obj_21)
       (pred_4  obj_17 obj_03)
       (pred_4  obj_28 obj_05)
       (pred_6 obj_04)
       (pred_6 obj_30)
       (pred_6 obj_18)
       (pred_6 obj_15)
       (pred_6 obj_25)
       (pred_6 obj_23)
       (pred_6 obj_26)
       (pred_6 obj_19)
       (pred_6 obj_11)
       (pred_6 obj_08)
       (pred_6 obj_31)
       (pred_6 obj_16)
       (pred_6 obj_10)
       (pred_6 obj_22)
       (pred_6 obj_27)
       (pred_6 obj_20)
       (pred_6 obj_02)
       (pred_6 obj_13)
       (pred_6 obj_24)
       (pred_6 obj_14)
       (pred_6 obj_06)
       (pred_6 obj_12)

       (pred_12  obj_29 obj_21)
       (pred_12  obj_07 obj_03)
       (pred_12  obj_09 obj_05)
       (pred_9 obj_29 obj_24)
       (pred_9 obj_07 obj_30)
       (pred_9 obj_09 obj_11)
       (pred_7 obj_31)
    )

    (:goal (and
       (pred_9 obj_29 obj_20)
       (pred_9 obj_09 obj_31)
    ))
(:constraints
  (always (not (pred_7 obj_16)))
)
)

; plan
1. (op_1 obj_31 obj_20)
   deleted: (pred_7 obj_31)
   added: (pred_7 obj_20)
   goals met: 0 of 2
2. (op_1 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 0 of 2
3. (op_1 obj_02 obj_13)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_13)
   goals met: 0 of 2
4. (op_1 obj_13 obj_10)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_10)
   goals met: 0 of 2
5. (op_1 obj_10 obj_22)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_22)
   goals met: 0 of 2
6. (op_1 obj_22 obj_11)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_11)
   goals met: 0 of 2
7. (op_5 obj_11 obj_09)
   deleted: (pred_9 obj_09 obj_11) (pred_1)
   added: (pred_2 obj_09)
   goals met: 0 of 2
8. (op_1 obj_11 obj_22)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_22)
   goals met: 0 of 2
9. (op_1 obj_22 obj_24)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_24)
   goals met: 0 of 2
10. (op_2 obj_24 obj_29 obj_09)
   deleted: (pred_2 obj_09) (pred_9 obj_29 obj_24)
   added: (pred_2 obj_29) (pred_9 obj_09 obj_24)
   goals met: 0 of 2
11. (op_1 obj_24 obj_13)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_13)
   goals met: 0 of 2
12. (op_1 obj_13 obj_02)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_02)
   goals met: 0 of 2
13. (op_1 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 0 of 2
14. (op_4 obj_20 obj_29)
   deleted: (pred_2 obj_29)
   added: (pred_1) (pred_9 obj_29 obj_20)
   goals met: 1 of 2
15. (op_1 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 1 of 2
16. (op_1 obj_02 obj_13)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_13)
   goals met: 1 of 2
17. (op_1 obj_13 obj_24)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_24)
   goals met: 1 of 2
18. (op_5 obj_24 obj_09)
   deleted: (pred_9 obj_09 obj_24) (pred_1)
   added: (pred_2 obj_09)
   goals met: 1 of 2
19. (op_1 obj_24 obj_13)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_13)
   goals met: 1 of 2
20. (op_1 obj_13 obj_02)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_02)
   goals met: 1 of 2
21. (op_1 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 1 of 2
22. (op_1 obj_20 obj_31)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_31)
   goals met: 1 of 2
23. (op_4 obj_31 obj_09)
   deleted: (pred_2 obj_09)
   added: (pred_1) (pred_9 obj_09 obj_31)
   goals met: 2 of 2
